yujiwei-777/STM32_TempMonitor_WithSerial/User/main.c
#include "stm32f10x.h"
#include "Delay.h"
#include "OLED.h"
#include "Buzzer.h"
#include "ADC.h"
#include "Serial.h"
#include "Motor.h"

// 温度阈值
static uint16_t tempThreshold = 30;

int main(void)
{
    OLED_Init();
    Buzzer_Init();
    ADC_Temp_Init();
    Serial_Init(115200);      // 串口初始化，波特率115200
    Motor_Init();

    OLED_ShowString(1, 1, "Temp:");
    OLED_ShowString(1, 12, "C");

    uint8_t sendCount = 0;

    while (1)
    {
        float temp = Get_Temperature();

        // OLED 显示温度（整数+小数）
        int integer_part = (int)temp;
        int decimal_part = (int)(temp * 10) % 10;
        OLED_ShowNum(1, 6, integer_part, 2);
        OLED_ShowChar(1, 8, '.');
        OLED_ShowNum(1, 9, decimal_part, 1);

        uint8_t isOverTemp = (temp > tempThreshold);

        // 蜂鸣器控制
        if (isOverTemp)
        {
            Buzzer_ON();
        }
        else
        {
            Buzzer_OFF();
        }

        // 电机控制
        if (isOverTemp)
            Motor_SetSpeed(70);     // 超温转速70%
        else
            Motor_SetSpeed(0);      // 停转

        // OLED 显示状态
        if (isOverTemp)
            OLED_ShowString(2, 1, "Warning");
        else
            OLED_ShowString(2, 1, "Normal  ");

        // 串口发送（每秒一次）
        sendCount++;
        if (sendCount >= 5)     // 200ms * 5 = 1s
        {
            sendCount = 0;
            Serial_SendString("Temp: ");
            Serial_SendFloat(temp, 1);
            Serial_SendString(" C\r\n");
        }

        Delay_ms(200);
    
    }
}

